# Add repository
tap "homebrew/cask" || true
tap "neovim/neovim"

# App directory
cask_args appdir: "/Applications"

# Install brew packages
## languages
brew "go"
brew "python"
brew "mono"
## brew "nvm"

## tools
brew "htop"
brew "imagemagick"
# brew "bash-completion"
# brew "tmux"
brew "wget"
brew "curl"
brew "ffmpeg"
brew "ripgrep"
brew "fzf"
brew "readline"
brew "yarn"
cask "docker"
cask "iterm2"
brew "cmake"

## editor
brew "neovim"
cask "visual-studio-code"
brew "macvim"

## cloud services
brew "awscli"
# cask "yandex-disk"

## other
brew "djvulibre"
cask "vlc"
brew "youtube-dl"
cask "google-chrome"
cask "microsoft-edge"
cask "firefox"
