# Add repository
tap "homebrew/cask" || true
tap "neovim/neovim"

# App directory
cask_args appdir: "/Applications"

# Install brew packages
brew "htop"
brew "neovim"
brew "bash-completion"
brew "imagemagick"
brew "djvulibre"
brew "docker"
brew "docker-compose"
brew "htop"
brew "yarn"
brew "youtube-dl"
brew "tmux"
brew "macvim"
brew "fzf"
brew "ripgrep"
brew "readline"
brew "ffmpeg"
brew "awscli"

# Install cask packages
cask "iterm2"
cask "google-chrome"
cask "firefox"
cask "visual-studio-code"
cask "vlc"
cask "yandex-disk"
